export const questions2017 =
[
  {
    id: "dhaka-2017-connectors",
    year: 2017,
    board: "Dhaka Board",
    passage: "Mobile phone has added a new dimension into our communication system. It has made the world closer to us. (a) ---, it has made worldwide communication easier. We use it for our day-to-day communication. (b) ---, it has been a part and parcel in our life as we cannot go for a single day without using it. We use it for rapid communication. (c) --- mobile phone is not free from defect. It has some negative sides as well. (d) --, excessive use of mobile phone may cause our hearing problem. (e) ---, it is a means of money wastage. (f) ---, it is seen that many underground crimes are being done with the use of mobile networks. (g) ---, the radiation from mobile phone may cause cancer to the users. (h) ---, we are aware of these harmful effects. (i) ---, we are not aware of using the mobile phone. (j)---, we must have to be conscious about the negative impact of mobile phone and accordingly, we should use it carefully.",
    blanks: [
      { id: "a", answer: "Besides", ruleId: 4, explanation: "Besides adds another benefit of mobile phones (easier communication), fitting Rule 4 (Moreover/ besides/ furthermore...) for additional points." },
      { id: "b", answer: "So", ruleId: 1, explanation: "So indicates the consequence of mobile phones being essential, aligning with Rule 1 (As a result/ so/ therefore...) for cause and effect." },
      { id: "c", answer: "But", ruleId: 18, explanation: "But contrasts the benefits with defects, matching Rule 18 (But/ on the other hand...) for contrasting ideas." },
      { id: "d", answer: "Firstly", ruleId: 17, explanation: "Firstly starts a sequence of negative sides, fitting Rule 17 (Firstly/ secondly/ thirdly) for sequential points." },
      { id: "e", answer: "Secondly", ruleId: 17, explanation: "Secondly continues the sequence of negative sides, matching Rule 17 (Firstly/ secondly/ thirdly) for sequential points." },
      { id: "f", answer: "Thirdly", ruleId: 17, explanation: "Thirdly further continues the sequence of negative sides, aligning with Rule 17 (Firstly/ secondly/ thirdly) for sequential points." },
      { id: "g", answer: "Finally", ruleId: 14, explanation: "Finally marks the last negative side in the sequence, fitting Rule 14 (At the end/ finally...) for concluding events." },
      { id: "h", answer: "However", ruleId: 27, explanation: "However contrasts awareness of harmful effects with the next point, matching Rule 27 (However/ nevertheless...) for contrasting ideas." },
      { id: "i", answer: "But", ruleId: 18, explanation: "But contrasts awareness of effects with lack of awareness in usage, aligning with Rule 18 (But/ on the other hand...) for contrast." },
      { id: "j", answer: "So", ruleId: 1, explanation: "So concludes the need for careful use due to negative impacts, fitting Rule 1 (As a result/ so/ therefore...) for cause and effect." }
    ]
  },
  {
    id: "rajshahi-2017-connectors",
    year: 2017,
    board: "Rajshahi Board",
    passage: "Man is a social being. (a) ---, man cannot live alone. (b) ---, man has been living together from time immemorial. Living in society is not an easy task. If we want to live in a society, we have to follow certain rules and regulations of that society. (c) ---, we have to be cooperative. (d) ----, we must help others when they need it. (e) ---, we have to be careful not to hurt others by our words or activities. (f) ----, we must control our emotions and behave well with others. (g) ---, we should not think and live only for us. (h) ---, we should always work for the betterment of the society. (i) ---, we should sacrifice our lives for others. (j)---, sacrificing our lives for others can make us immortal.",
    blanks: [
      { id: "a", answer: "So", ruleId: 1, explanation: "So indicates the consequence of man being a social being, fitting Rule 1 (As a result/ so/ therefore...) for cause and effect." },
      { id: "b", answer: "In fact", ruleId: 29, explanation: "In fact emphasizes the truth of man living together historically, aligning with Rule 29 (Really/ actually/ in fact...) for asserting truth." },
      { id: "c", answer: "Firstly", ruleId: 17, explanation: "Firstly starts a sequence of societal rules, fitting Rule 17 (Firstly/ secondly/ thirdly) for sequential points." },
      { id: "d", answer: "Therefore", ruleId: 1, explanation: "Therefore shows the result of needing to be cooperative, matching Rule 1 (As a result/ so/ therefore...) for cause and effect." },
      { id: "e", answer: "Secondly", ruleId: 17, explanation: "Secondly continues the sequence of societal rules, aligning with Rule 17 (Firstly/ secondly/ thirdly) for sequential points." },
      { id: "f", answer: "That is why", ruleId: 1, explanation: "That is why explains the need to control emotions due to not hurting others, fitting Rule 1 (As a result/ so/ therefore...) for cause and effect." },
      { id: "g", answer: "Thirdly", ruleId: 17, explanation: "Thirdly further continues the sequence of societal rules, matching Rule 17 (Firstly/ secondly/ thirdly) for sequential points." },
      { id: "h", answer: "Rather", ruleId: 31, explanation: "Rather emphasizes working for society over personal gain, aligning with Rule 31 (Rather) for emphasis." },
      { id: "i", answer: "So", ruleId: 1, explanation: "So indicates the consequence of societal betterment leading to sacrifice, fitting Rule 1 (As a result/ so/ therefore...) for cause and effect." },
      { id: "j", answer: "In fact", ruleId: 29, explanation: "In fact emphasizes the truth that sacrifice leads to immortality, matching Rule 29 (Really/ actually/ in fact...) for asserting truth." }
    ]
  },
  {
    id: "cumilla-2017-connectors",
    year: 2017,
    board: "Cumilla Board",
    passage: "Trees are a vital part of our environment, (a) ---, they bear a great impact on the climate. (b) --- we are not careful about them. (c) ---, we destroy trees at random. (d) ---, one day the country will bear the consequence of greenhouse effect. (e) --- ours is an agricultural country, our economy depends upon it. (f) ---, our agriculture is dependent on rain, (g) --- trees play a vital role on our climate, (h) ---, trees keep the soil strong. (i) ---, trees save us from flood (j) --- many other natural calamities.",
    blanks: [
      { id: "a", answer: "In fact", ruleId: 29, explanation: "In fact emphasizes the truth of trees’ impact on climate, fitting Rule 29 (Really/ actually/ in fact...) for asserting truth." },
      { id: "b", answer: "Yet", ruleId: 55, explanation: "Yet contrasts the importance of trees with lack of care, aligning with Rule 55 (Yet) for contrasting ideas." },
      { id: "c", answer: "Rather", ruleId: 31, explanation: "Rather emphasizes the destructive action over care, matching Rule 31 (Rather) for emphasis." },
      { id: "d", answer: "As a result", ruleId: 1, explanation: "As a result indicates the consequence of tree destruction, fitting Rule 1 (As a result/ so/ therefore...) for cause and effect." },
      { id: "e", answer: "As", ruleId: 49, explanation: "As introduces the reason why the economy depends on agriculture, aligning with Rule 49 (As/ since/ because...) for indicating cause." },
      { id: "f", answer: "Besides", ruleId: 4, explanation: "Besides adds the point about agriculture’s dependence on rain, fitting Rule 4 (Moreover/ besides/ furthermore...) for additional points." },
      { id: "g", answer: "Again", ruleId: 4, explanation: "Again adds another point about trees’ role in climate, matching Rule 4 (Moreover/ besides/ again...) for additional points." },
      { id: "h", answer: "Next", ruleId: 17, explanation: "Next continues the sequence of trees’ benefits, aligning with Rule 17 (Firstly/ secondly/ thirdly) for sequential points, as it functions similarly to sequential connectors." },
      { id: "i", answer: "Furthermore", ruleId: 4, explanation: "Furthermore adds another benefit of trees, fitting Rule 4 (Moreover/ besides/ furthermore...) for additional points." },
      { id: "j", answer: "Thus", ruleId: 25, explanation: "Thus describes the outcome of trees’ role in preventing calamities, matching Rule 25 (Thus/ in this way) for describing how events occur." }
    ]
  },
  {
    id: "barishal-2017-connectors",
    year: 2017,
    board: "Barishal Board",
    passage: "Water is a vital element of the environment (a)--- this element is polluted in many ways. (b)--- farmers use chemical fertilizers and insecticides in their field. (c) --- rain and flood wash away these chemicals, they get mixed with water in rivers, canals and ponds (d) --- pollute it. (e)--- mills and factories throw their poisonous chemicals and waste product into water. (f) --- water vehicles also pollute water by dumping food waste and human waste into it. (g) --- insanitary latrines and unsafe drains also contribute to water pollution. Water is called life. (h) --- we cannot allow this pollution to continue. We have to raise an awareness about it. (i) ---, laws should be enforced strictly. (j) --- we fail to check water pollution, we will suffer.",
    blanks: [
      { id: "a", answer: "But", ruleId: 18, explanation: "But contrasts water’s importance with its pollution, fitting Rule 18 (But/ on the other hand...) for contrasting ideas." },
      { id: "b", answer: "Firstly", ruleId: 17, explanation: "Firstly starts a sequence of pollution causes, aligning with Rule 17 (Firstly/ secondly/ thirdly) for sequential points." },
      { id: "c", answer: "When", ruleId: 26, explanation: "When indicates the timing of chemicals mixing with water, fitting Rule 26 (When/ while) for concurrent events." },
      { id: "d", answer: "And", ruleId: 5, explanation: "And connects the mixing of chemicals with pollution, matching Rule 5 (And/ as well as...) for joining elements." },
      { id: "e", answer: "Secondly", ruleId: 17, explanation: "Secondly continues the sequence of pollution causes, aligning with Rule 17 (Firstly/ secondly/ thirdly) for sequential points." },
      { id: "f", answer: "Moreover", ruleId: 4, explanation: "Moreover adds another cause of pollution, fitting Rule 4 (Moreover/ besides/ furthermore...) for additional points." },
      { id: "g", answer: "Finally", ruleId: 14, explanation: "Finally marks the last cause of pollution, matching Rule 14 (At the end/ finally...) for concluding events." },
      { id: "h", answer: "So", ruleId: 1, explanation: "So indicates the consequence of water’s importance, necessitating action, fitting Rule 1 (As a result/ so/ therefore...) for cause and effect." },
      { id: "i", answer: "Therefore", ruleId: 1, explanation: "Therefore suggests enforcing laws as a result of the need for awareness, matching Rule 1 (As a result/ so/ therefore...) for cause and effect." },
      { id: "j", answer: "If", ruleId: 37, explanation: "If introduces a conditional outcome of failing to control pollution, fitting Rule 37 (If/ even if/ unless) for conditional statements." }
    ]
  },
  {
    id: "sylhet-2017-connectors",
    year: 2017,
    board: "Sylhet Board",
    passage: "Honesty is a noble virtue. The man possessing this invaluable quality is the happiest man on earth, (a)---. To be honest, a man should have trustworthiness. (b)---, nobody trusts a liar. A liar may prosper for the time being. (c)---, he goes to the dogs. (d)---. we should be honest. It is said that honesty is the best policy. (e)--- dishonesty is the sign of downfall. God helps those who are honest. (f)---, dishonest people are cursed. (g)--- children should be taught honesty from childhood. It is widely observed that children follow their parents. (h)--- business of life. (i)---, children should be allowed to mix with those friends who are honest. (j)--- they can mould their characters.",
    blanks: [
      { id: "a", answer: "Indeed", ruleId: 29, explanation: "Indeed emphasizes the truth of the happiest man claim, fitting Rule 29 (Really/ actually/ in fact...) for asserting truth." },
      { id: "b", answer: "Because", ruleId: 49, explanation: "Because explains why nobody trusts a liar, aligning with Rule 49 (As/ since/ because...) for indicating cause." },
      { id: "c", answer: "But", ruleId: 18, explanation: "But contrasts temporary prosperity with eventual failure, matching Rule 18 (But/ on the other hand...) for contrast." },
      { id: "d", answer: "So", ruleId: 1, explanation: "So concludes the need for honesty based on the liar’s fate, fitting Rule 1 (As a result/ so/ therefore...) for cause and effect." },
      { id: "e", answer: "Whereas", ruleId: 18, explanation: "Whereas contrasts honesty with dishonesty’s downfall, aligning with Rule 18 (But/ on the other hand...) for contrast." },
      { id: "f", answer: "On the other hand", ruleId: 18, explanation: "On the other hand contrasts God’s help for the honest with curses for the dishonest, fitting Rule 18 (But/ on the other hand...) for contrast." },
      { id: "g", answer: "So", ruleId: 1, explanation: "So indicates the consequence of children following parents, necessitating teaching honesty, matching Rule 1 (As a result/ so/ therefore...) for cause and effect." },
      { id: "h", answer: "That is why", ruleId: 1, explanation: "That is why explains why parents’ influence affects children’s honesty, fitting Rule 1 (As a result/ so/ therefore...) for cause and effect." },
      { id: "i", answer: "In addition", ruleId: 4, explanation: "In addition adds the point about choosing honest friends, matching Rule 4 (Moreover/ besides/ furthermore...) for additional points." },
      { id: "j", answer: "Thus", ruleId: 25, explanation: "Thus describes how honest friends help mould character, fitting Rule 25 (Thus/ in this way) for describing how events occur." }
    ]
  }
]